systems/EFI/- Arkiv/100614 Pakker til konsortiet AD, BFY, Captia, DMR, ES, Forskud Slut 3S Svur, Slsp, eIndkomst/100611 A D/WSDL/package/wsdl/FormateretMeddelelseIndholdMultiHent.wsdl

<?xml version="1.0" encoding="UTF-8"?>
<definitions targetNamespace="http://skat.dk/begrebsmodel/2009/01/15/" name="FormateretMeddelelseIndholdMultiHentService" xmlns:fase2.1="http://skat.dk/begrebsmodel/2009/01/15/" xmlns="http://schemas.xmlsoap.org/wsdl/" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:soap="http://schemas.xmlsoap.org/wsdl/soap/">
   
   <xs:annotation xmlns:xs="http://www.w3.org/2001/XMLSchema">
      
      <xs:documentation>Henter indholdet af en eller flere formaterede meddelelser.</xs:documentation>
   
   </xs:annotation>
   
   <types>
      
      <xsd:schema xmlns:xsd="http://www.w3.org/2001/XMLSchema" targetNamespace="http://skat.dk/begrebsmodel/2009/01/15/">
         
         <xsd:include schemaLocation="../service/FormateretMeddelelseIndholdMultiHentInterface.xsd"/>
      
      </xsd:schema>
   
   </types>
   
   <message name="FormateretMeddelelseIndholdMultiHentServiceRequest">
      
      <part name="Request" element="fase2.1:FormateretMeddelelseIndholdMultiHent_I"/>
   
   </message>
   
   <message name="FormateretMeddelelseIndholdMultiHentServiceResponse">
      
      <part name="Response" element="fase2.1:FormateretMeddelelseIndholdMultiHent_O"/>
   
   </message>
   
   <message name="KompenserTransRequest">
      
      <part name="Request" element="fase2.1:KompenserTrans"/>
   
   </message>
   
   <message name="KompenserTransResponse">
      
      <part name="Response" element="fase2.1:KompenserTransSvar"/>
   
   </message>
   
   <portType name="FormateretMeddelelseIndholdMultiHentServicePortType">
      
      <operation name="getFormateretMeddelelseIndholdMultiHent">
         
         <input message="fase2.1:FormateretMeddelelseIndholdMultiHentServiceRequest"/>
         
         <output message="fase2.1:FormateretMeddelelseIndholdMultiHentServiceResponse"/>
      
      </operation>
      
      <operation name="getKompenserTrans">
         
         <input message="fase2.1:KompenserTransRequest"/>
         
         <output message="fase2.1:KompenserTransResponse"/>
      
      </operation>
   
   </portType>

</definitions>
