ici-test-automation-feature-environment-readiness/ic-integration-tests/src/test/resources/aogd/formateretMeddelelseIndholdMultiHent/I_MalformedBodyRequestEnvelope.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:ns="http://skat.dk/begrebsmodel/2009/01/15/">
   <soapenv:Header>
      <wsse:Security xmlns:wsse="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-secext-1.0.xsd">
         <Assertion AssertionID="a111a111aa111aaaa1aaa11aaa11aaaa" IssueInstant="2007-05-14T11:45:21.835Z" Issuer="test.unsigned" MajorVersion="1" MinorVersion="1" xmlns="urn:oasis:names:tc:SAML:1.0:assertion" xmlns:saml="urn:oasis:names:tc:SAML:1.0:assertion" xmlns:samlp="urn:oasis:names:tc:SAML:1.0:protocol">
            <Conditions NotBefore="2007-05-14T11:43:21.834Z" NotOnOrAfter="2022-05-14T11:43:21.834Z"/>
            <AuthenticationStatement AuthenticationInstant="2007-05-14T11:45:21.834Z" AuthenticationMethod="urn:oasis:names:tc:SAML:1.0:am:unspecified">
               <Subject>
                  <NameIdentifier Format="urn:oasis:names:tc:SAML:1.1:nameid-format:unspecified" NameQualifier="skat">skatGuid=w12345,ou=skatEmployee,ou=internal,ou=entities,dc=skat,dc=dk</NameIdentifier>
                  <SubjectConfirmation>
                     <ConfirmationMethod>urn:oasis:names:tc:SAML:1.0:cm:sender-vouches</ConfirmationMethod>
                  </SubjectConfirmation>
               </Subject>
            </AuthenticationStatement>
            <AttributeStatement>
               <Subject>
                  <NameIdentifier Format="urn:oasis:names:tc:SAML:1.1:nameid-format:unspecified" NameQualifier="skat">skatGuid=w12345,ou=skatEmployee,ou=internal,ou=entities,dc=skat,dc=dk</NameIdentifier>
                  <SubjectConfirmation>
                     <ConfirmationMethod>urn:oasis:names:tc:SAML:1.0:cm:sender-vouches</ConfirmationMethod>
                  </SubjectConfirmation>
               </Subject>
               <Attribute AttributeName="Groups" AttributeNamespace="urn:bea:security:saml:groups" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance">
                  <AttributeValue>PRIMARY_IDENTITY_skatGuid=w12345,ou=skatEmployee,ou=internal,ou=entities,dc=skat,dc=dk</AttributeValue>
                  <AttributeValue>AUTH_LEVEL_6</AttributeValue>
                  <AttributeValue>ABCDabcdefghijklMNO</AttributeValue>
               </Attribute>
            </AttributeStatement>
         </Assertion>
      </wsse:Security>
   </soapenv:Header>
   <soapenv:Body>
      <ns:FormateretMeddelelseIndholdMultiHent_I>
         <ns:Kontekst>
            <tsk:HovedOplysninger xmlns:tsk="http://skat.dk/begrebsmodel/xml/schemas/kontekst/2007/05/31/">
               <tsk:TransaktionsID>${=java.util.UUID.randomUUID().toString()}_${=System.getProperty("user.name")}</tsk:TransaktionsID>
               <tsk:TransaktionsTid>${Date}T${timestamp}Z</tsk:TransaktionsTid>
            </tsk:HovedOplysninger>
         </ns:Kontekst>
         <ns:Meddelelser>
            <ns:Meddelelse>
               <ns:FormateretMeddelelseFormat>1</ns:FormateretMeddelelseFormat>
               <ns:Identifikation>
      </ns:FormateretMeddelelseIndholdMultiHent_I>
   </soapenv:Body>
</soapenv:Envelope>