ici-test-automation-feature-environment-readiness/ic-integration-tests/src/test/resources/aogd/formateretMeddelelseIndholdMultiHent/I_ValidRequestEnvelope.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:ns="http://skat.dk/begrebsmodel/2009/01/15/">
   <soapenv:Header>
   </soapenv:Header>
   <soapenv:Body>
      <ns:FormateretMeddelelseIndholdMultiHent_I>
		<ns:Meddelelser>
			<ns:Meddelelse>
				<ns:FormateretMeddelelseFormat>application/pdf</ns:FormateretMeddelelseFormat>
				<ns:Identifikation>
					<ns:MeddelelseID>${Properties#MeddelelseID}</ns:MeddelelseID>
				</ns:Identifikation>
			</ns:Meddelelse>
		</ns:Meddelelser>
      </ns:FormateretMeddelelseIndholdMultiHent_I>
   </soapenv:Body>
</soapenv:Envelope>